article/constructivism-computer-and-programming-language.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-13 Mon 04:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>constructivism, computer and programming language</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="../asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
近死之心 莫使復陽也
</div>
<div id="content">
<h1 class="title">constructivism, computer and programming language</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7fb9dbf">intro</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7fb9dbf" class="outline-2">
<h2 id="org7fb9dbf">intro</h2>
<div class="outline-text-2" id="text-org7fb9dbf">
<ol class="org-ol">
<li><p>
Digital computers, nowaday, are often viewed as so unhuman.
</p>

<p>
While actually, the abstract prototype of digital computer
&#x2013; the Turing machine, is a model based on human computers
&#x2013; people who perform mathematical calculations.
</p>

<p>
The purpose of this modeling is to serve Turing's project,
which is to inquire the nature of mathematical calculations,
i.e. to understand computability.
</p></li>

<li><p>
As the art of manufacturing digital computers,
and the art of programming them, are so developed today,
a similar project, to inquire the nature of mathematical truth,
is naturally taken up by mathematicians,
in a certain computer aided way.
</p>

<p>
Since mathematical truth is ensured by deduction,
the steps of which, being written down, is called proof.
</p>

<p>
This time, the model is the type system of programming language,
with which the deductive rules of mathematics are built in,
</p>

<p>
We have type as proposition, function as proof.
</p>

<p>
The language game of mathematics is modeled by
the language game of programming.
[wittgenstein]
</p></li>

<li>The language game of programming is so special,
&gt;&lt;&gt;&lt;&gt;&lt;</li>

<li><p>
constructivism is not to limit &gt;&lt;&gt;&lt; the way how mathematics are studied,
[not as early wittgenstein]
but to draw a map
a map with rich information
[bishop's project]
</p>

<p>
just as Turing has successfully did
</p></li></ol>
</div>
</div>
</div>
<div id="postamble" class="status">
近死之心 莫使復陽也
</div>
</body>
</html>
